[Killed] BlockStatement
src/gilded_rose.mjs:14:19
     this.items = items;
   }
 
-  updateQuality() {
-    for (var i = 0; i < this.items.length; i++) {
-      if(this.items[i].name == "Sulfuras" ) {
-
-      } else if (this.items[i].name == "Aged Brie") {
-        this.updateAgeBrieQuality(i);
-      } else if (this.items[i].name == "Backstage passes") {
-        this.updateBackstagePassQuality(i);
-      } else if (this.items[i].name == "Conjured") {
-        this.updateConjuredQuality(i);
-      } else {
-        this.updateQualityForNormalItems(i);
-      }
-    }
-    return this.items;
-  }
+  updateQuality() {}
 
   updateConjuredQuality(i) {
killedBy: For normal items in store after updating quality Quality does not degrade under 0
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/gilded_rose.mjs:16:10
 
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
-      if(this.items[i].name == "Sulfuras" ) {
+      if(true ) {
 
       } else if (this.items[i].name == "Aged Brie") {
killedBy: For normal items in store after updating quality items degrade twice as fast on sell inn date
statusReason: expected 50 to equal 48

[Killed] EqualityOperator
src/gilded_rose.mjs:16:10
 
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
-      if(this.items[i].name == "Sulfuras" ) {
+      if(this.items[i].name != "Sulfuras" ) {
 
       } else if (this.items[i].name == "Aged Brie") {
killedBy: For normal items in store after updating quality items degrade twice as fast on sell inn date
statusReason: expected 50 to equal 48

[Killed] ConditionalExpression
src/gilded_rose.mjs:18:18
     for (var i = 0; i < this.items.length; i++) {
       if(this.items[i].name == "Sulfuras" ) {
 
-      } else if (this.items[i].name == "Aged Brie") {
+      } else if (true) {
         this.updateAgeBrieQuality(i);
       } else if (this.items[i].name == "Backstage passes") {
killedBy: For normal items in store after updating quality Quality does not degrade under 0
statusReason: expected 2 to equal +0

[Killed] EqualityOperator
src/gilded_rose.mjs:18:18
     for (var i = 0; i < this.items.length; i++) {
       if(this.items[i].name == "Sulfuras" ) {
 
-      } else if (this.items[i].name == "Aged Brie") {
+      } else if (this.items[i].name != "Aged Brie") {
         this.updateAgeBrieQuality(i);
       } else if (this.items[i].name == "Backstage passes") {
killedBy: For normal items in store after updating quality Quality does not degrade under 0
statusReason: expected 2 to equal +0

[Killed] EqualityOperator
src/gilded_rose.mjs:20:18
 
       } else if (this.items[i].name == "Aged Brie") {
         this.updateAgeBrieQuality(i);
-      } else if (this.items[i].name == "Backstage passes") {
+      } else if (this.items[i].name != "Backstage passes") {
         this.updateBackstagePassQuality(i);
       } else if (this.items[i].name == "Conjured") {
killedBy: For normal items in store after updating quality items degrade twice as fast on sell inn date
statusReason: expected +0 to equal 48

[Killed] BlockStatement
src/gilded_rose.mjs:20:60
 
       } else if (this.items[i].name == "Aged Brie") {
         this.updateAgeBrieQuality(i);
-      } else if (this.items[i].name == "Backstage passes") {
-        this.updateBackstagePassQuality(i);
-      } else if (this.items[i].name == "Conjured") {
+      } else if (this.items[i].name == "Backstage passes") {} else if (this.items[i].name == "Conjured") {
         this.updateConjuredQuality(i);
       } else {
killedBy: Backstage passes Quality increases by one when sell in date is greater than 10
statusReason: expected 11 to equal 10

[Killed] ConditionalExpression
src/gilded_rose.mjs:22:18
         this.updateAgeBrieQuality(i);
       } else if (this.items[i].name == "Backstage passes") {
         this.updateBackstagePassQuality(i);
-      } else if (this.items[i].name == "Conjured") {
+      } else if (true) {
         this.updateConjuredQuality(i);
       } else {
killedBy: For normal items in store after updating quality items degrade twice as fast on sell inn date
statusReason: expected 46 to equal 48

[Killed] BlockStatement
src/gilded_rose.mjs:22:52
         this.updateAgeBrieQuality(i);
       } else if (this.items[i].name == "Backstage passes") {
         this.updateBackstagePassQuality(i);
-      } else if (this.items[i].name == "Conjured") {
-        this.updateConjuredQuality(i);
-      } else {
+      } else if (this.items[i].name == "Conjured") {} else {
         this.updateQualityForNormalItems(i);
       }
killedBy: Conjured Sell in date drops by one
statusReason: expected 10 to equal 9

[Killed] BlockStatement
src/gilded_rose.mjs:24:14
         this.updateBackstagePassQuality(i);
       } else if (this.items[i].name == "Conjured") {
         this.updateConjuredQuality(i);
-      } else {
-        this.updateQualityForNormalItems(i);
-      }
+      } else {}
     }
     return this.items;
killedBy: For normal items in store after updating quality items degrade twice as fast on sell inn date
statusReason: expected 50 to equal 48

[Killed] BlockStatement
src/gilded_rose.mjs:31:28
     return this.items;
   }
 
-  updateConjuredQuality(i) {
-    this.reduceQuality(i, 2);
-    if (this.items[i].sellIn < 1) {
-      this.reduceQuality(i, 2);
-    } 
-    this.items[i].sellIn--;
-  }
+  updateConjuredQuality(i) {}
   
   updateAgeBrieQuality(i) {
killedBy: Conjured Sell in date drops by one
statusReason: expected 10 to equal 9

[Killed] BlockStatement
src/gilded_rose.mjs:33:35
 
   updateConjuredQuality(i) {
     this.reduceQuality(i, 2);
-    if (this.items[i].sellIn < 1) {
-      this.reduceQuality(i, 2);
-    } 
+    if (this.items[i].sellIn < 1) {} 
     this.items[i].sellIn--;
   }
killedBy: Conjured Quality reduces by 4 when sell in date is 0 or less
statusReason: expected 38 to equal 36

[Killed] EqualityOperator
src/gilded_rose.mjs:33:9
 
   updateConjuredQuality(i) {
     this.reduceQuality(i, 2);
-    if (this.items[i].sellIn < 1) {
+    if (this.items[i].sellIn >= 1) {
       this.reduceQuality(i, 2);
     } 
killedBy: Conjured Quality reduces by 2 when sell in date is greater than 0
statusReason: expected 36 to equal 38

[Killed] UpdateOperator
src/gilded_rose.mjs:36:5
     if (this.items[i].sellIn < 1) {
       this.reduceQuality(i, 2);
     } 
-    this.items[i].sellIn--;
+    this.items[i].sellIn++;
   }
   
killedBy: Conjured Sell in date drops by one
statusReason: expected 11 to equal 9

[Killed] BlockStatement
src/gilded_rose.mjs:39:27
     this.items[i].sellIn--;
   }
   
-  updateAgeBrieQuality(i) {
-    if (this.items[i].sellIn < 1) {
-      this.increaseQuality(i, 2);
-    } else this.increaseQuality(i);
-    this.items[i].sellIn--;
-  }
+  updateAgeBrieQuality(i) {}
 
   updateBackstagePassQuality(i) {
killedBy: Aged Brie Sell in date is updated normally
statusReason: expected 2 to equal 1

[Killed] ConditionalExpression
src/gilded_rose.mjs:40:9
   }
   
   updateAgeBrieQuality(i) {
-    if (this.items[i].sellIn < 1) {
+    if (true) {
       this.increaseQuality(i, 2);
     } else this.increaseQuality(i);
killedBy: Aged Brie Sell in date is updated normally
statusReason: expected 2 to equal 1

[Killed] EqualityOperator
src/gilded_rose.mjs:40:9
   }
   
   updateAgeBrieQuality(i) {
-    if (this.items[i].sellIn < 1) {
+    if (this.items[i].sellIn <= 1) {
       this.increaseQuality(i, 2);
     } else this.increaseQuality(i);
killedBy: Aged Brie Quality does not go over 50
statusReason: expected 3 to equal 2

[Killed] UpdateOperator
src/gilded_rose.mjs:43:5
     if (this.items[i].sellIn < 1) {
       this.increaseQuality(i, 2);
     } else this.increaseQuality(i);
-    this.items[i].sellIn--;
+    this.items[i].sellIn++;
   }
 
killedBy: Aged Brie Sell in date is updated normally
statusReason: expected 3 to equal 1

[Killed] BlockStatement
src/gilded_rose.mjs:46:33
     this.items[i].sellIn--;
   }
 
-  updateBackstagePassQuality(i) {
-    if (this.items[i].sellIn < 1) {
-      this.items[i].quality = 0;
-    }
-    if (this.items[i].sellIn > 0) {
-      this.increaseQuality(i);
-      if (this.items[i].sellIn < 11) {
-        this.increaseQuality(i);
-      }
-      if (this.items[i].sellIn < 6) {
-        this.increaseQuality(i);
-      }
-    }
-    this.items[i].sellIn--;
-  }
+  updateBackstagePassQuality(i) {}
 
   updateQualityForNormalItems(i) {
killedBy: Backstage passes Quality increases by one when sell in date is greater than 10
statusReason: expected 11 to equal 10

[Killed] BlockStatement
src/gilded_rose.mjs:47:35
   }
 
   updateBackstagePassQuality(i) {
-    if (this.items[i].sellIn < 1) {
-      this.items[i].quality = 0;
-    }
+    if (this.items[i].sellIn < 1) {}
     if (this.items[i].sellIn > 0) {
       this.increaseQuality(i);
killedBy: Backstage passes Quality drops to zero when sell in date is 0
statusReason: expected 25 to equal +0

[Killed] ConditionalExpression
src/gilded_rose.mjs:47:9
   }
 
   updateBackstagePassQuality(i) {
-    if (this.items[i].sellIn < 1) {
+    if (true) {
       this.items[i].quality = 0;
     }
killedBy: Backstage passes Quality increases by one when sell in date is greater than 10
statusReason: expected 1 to equal 26

[Killed] ConditionalExpression
src/gilded_rose.mjs:50:9
     if (this.items[i].sellIn < 1) {
       this.items[i].quality = 0;
     }
-    if (this.items[i].sellIn > 0) {
+    if (false) {
       this.increaseQuality(i);
       if (this.items[i].sellIn < 11) {
killedBy: Backstage passes Quality increases by one when sell in date is greater than 10
statusReason: expected 25 to equal 26

[Killed] EqualityOperator
src/gilded_rose.mjs:50:9
     if (this.items[i].sellIn < 1) {
       this.items[i].quality = 0;
     }
-    if (this.items[i].sellIn > 0) {
+    if (this.items[i].sellIn <= 0) {
       this.increaseQuality(i);
       if (this.items[i].sellIn < 11) {
killedBy: Backstage passes Quality increases by one when sell in date is greater than 10
statusReason: expected 25 to equal 26

[Killed] EqualityOperator
src/gilded_rose.mjs:52:11
     }
     if (this.items[i].sellIn > 0) {
       this.increaseQuality(i);
-      if (this.items[i].sellIn < 11) {
+      if (this.items[i].sellIn <= 11) {
         this.increaseQuality(i);
       }
killedBy: Backstage passes Quality increases by one when sell in date is greater than 10
statusReason: expected 27 to equal 26

[Killed] BlockStatement
src/gilded_rose.mjs:52:38
     }
     if (this.items[i].sellIn > 0) {
       this.increaseQuality(i);
-      if (this.items[i].sellIn < 11) {
-        this.increaseQuality(i);
-      }
+      if (this.items[i].sellIn < 11) {}
       if (this.items[i].sellIn < 6) {
         this.increaseQuality(i);
killedBy: Backstage passes Quality increases by two when sell in date is greater than 5 but less than 10
statusReason: expected 26 to equal 27

[Killed] BlockStatement
src/gilded_rose.mjs:55:37
       if (this.items[i].sellIn < 11) {
         this.increaseQuality(i);
       }
-      if (this.items[i].sellIn < 6) {
-        this.increaseQuality(i);
-      }
+      if (this.items[i].sellIn < 6) {}
     }
     this.items[i].sellIn--;
killedBy: Backstage passes Quality increases by three when sell in date is greater than 0 but less than 5
statusReason: expected 27 to equal 28

[Killed] BlockStatement
src/gilded_rose.mjs:62:34
     this.items[i].sellIn--;
   }
 
-  updateQualityForNormalItems(i) {
-    this.reduceQuality(i);
-    if (this.items[i].sellIn <= 0) {
-      this.reduceQuality(i);
-    }
-  
-    this.items[i].sellIn--;
-  }
+  updateQualityForNormalItems(i) {}
 
   reduceQuality(itemIndex, amount=1) {
killedBy: For normal items in store after updating quality items degrade twice as fast on sell inn date
statusReason: expected 50 to equal 48

[Killed] ConditionalExpression
src/gilded_rose.mjs:64:9
 
   updateQualityForNormalItems(i) {
     this.reduceQuality(i);
-    if (this.items[i].sellIn <= 0) {
+    if (true) {
       this.reduceQuality(i);
     }
killedBy: For normal items in store after updating quality items degrade normally
statusReason: expected 1 to equal 2

[Killed] EqualityOperator
src/gilded_rose.mjs:64:9
 
   updateQualityForNormalItems(i) {
     this.reduceQuality(i);
-    if (this.items[i].sellIn <= 0) {
+    if (this.items[i].sellIn < 0) {
       this.reduceQuality(i);
     }
killedBy: For normal items in store after updating quality items degrade twice as fast on sell inn date
statusReason: expected 49 to equal 48

[Killed] UpdateOperator
src/gilded_rose.mjs:68:5
       this.reduceQuality(i);
     }
   
-    this.items[i].sellIn--;
+    this.items[i].sellIn++;
   }
 
killedBy: For normal items in store after updating quality items sell in date is reduced
statusReason: expected 3 to equal 1

[Killed] BlockStatement
src/gilded_rose.mjs:71:38
     this.items[i].sellIn--;
   }
 
-  reduceQuality(itemIndex, amount=1) {
-    this.items[itemIndex].quality = Math.max(0, this.items[itemIndex].quality - amount);
-  }
+  reduceQuality(itemIndex, amount=1) {}
 
   increaseQuality(itemIndex, amount=1) {
killedBy: For normal items in store after updating quality items degrade twice as fast on sell inn date
statusReason: expected 50 to equal 48

[Killed] ArithmeticOperator
src/gilded_rose.mjs:72:49
   }
 
   reduceQuality(itemIndex, amount=1) {
-    this.items[itemIndex].quality = Math.max(0, this.items[itemIndex].quality - amount);
+    this.items[itemIndex].quality = Math.max(0, this.items[itemIndex].quality + amount);
   }
 
killedBy: For normal items in store after updating quality Quality does not degrade under 0
statusReason: expected 2 to equal +0

[Killed] MethodExpression
src/gilded_rose.mjs:72:37
   }
 
   reduceQuality(itemIndex, amount=1) {
-    this.items[itemIndex].quality = Math.max(0, this.items[itemIndex].quality - amount);
+    this.items[itemIndex].quality = Math.min(0, this.items[itemIndex].quality - amount);
   }
 
killedBy: For normal items in store after updating quality Quality does not degrade under 0
statusReason: expected -2 to equal +0

[Killed] BlockStatement
src/gilded_rose.mjs:75:40
     this.items[itemIndex].quality = Math.max(0, this.items[itemIndex].quality - amount);
   }
 
-  increaseQuality(itemIndex, amount=1) {
-    this.items[itemIndex].quality = Math.min(50, this.items[itemIndex].quality + amount);
-  }
+  increaseQuality(itemIndex, amount=1) {}
 }
 
killedBy: Aged Brie Sell in date is updated normally
statusReason: expected +0 to equal 1

[Killed] ArithmeticOperator
src/gilded_rose.mjs:76:50
   }
 
   increaseQuality(itemIndex, amount=1) {
-    this.items[itemIndex].quality = Math.min(50, this.items[itemIndex].quality + amount);
+    this.items[itemIndex].quality = Math.min(50, this.items[itemIndex].quality - amount);
   }
 }
killedBy: Aged Brie Sell in date is updated normally
statusReason: expected -1 to equal 1

[Killed] MethodExpression
src/gilded_rose.mjs:76:37
   }
 
   increaseQuality(itemIndex, amount=1) {
-    this.items[itemIndex].quality = Math.min(50, this.items[itemIndex].quality + amount);
+    this.items[itemIndex].quality = Math.max(50, this.items[itemIndex].quality + amount);
   }
 }
killedBy: Aged Brie Sell in date is updated normally
statusReason: expected 50 to equal 1
